import { Box, Container, Grid, Typography } from '@mui/material';
import React from 'react';
import projectImg1 from '../../../assets/images/news-slider-img.png';
import '../../../assets/styles/Projects.css';

const ProjectSection = () => {
    return (
        <>
            {/* <Container> */}
                <Box className='pjt-section-container'>
                    <Typography>الضبيب ووكيل</Typography>

                    <Box className='pjt-top-section'>
                    <Container>
                        <Grid alignItems='center' container spacing={3}>
                            <Grid item xs={12} md={7} order={{xs: 2, md:1 }} >
                                <Box className='pjt-right_content'>
                                <Typography variant="h4">الضبيب ووكيل</Typography>
                                    <Typography>
                                    دشَّن المركز الوطني لسلامة الطرق بالشراكة مع القوات الخاصة لأمن الطرق اليوم حملة ” درب السلامة ” تزامناً مع بدء موسم الإجازة بمركز الضبط الأمني بطريق الرياض / الدمام بحضور قائد القوات الخاصة لأمن الطرق اللواء خالد الضبيب ووكيل وزارة النقل المهندس طارق الشامي ورئيس المركز الوطني لسلامة الطرق الدكتور علي الغامدي
                                وتستهدف الحملة المسافرين خلال موسم الإجازة لرفع مستوى التوعية بالسلامة المرورية عن طريق المنشورات الورقية ولوحات الطرق والمحتوى الرقمي بمواقع التواصل الاجتماعي

                                <br /><br />
                                وركزت الحملة على تعزيز التوعية بأبرز الممارسات السليمة لقائدي المركبات كضرورة ربط حزام الأمان وفحص المركبة والإطارات قبل السفر وأخذ قسط كافي من النوم، إلى جانب تعزيز التنبيه بأبرز الممارسات الخاطئة التي قد يقع فيها قائد المركبة كاستخدام الجوال والسرعة الزائدة 
                                وركز جانب من الحملة على غرس مفاهيم سلامة الأطفال عبر استهدافهم برسائل توعوية تأسس هذه المبادئ
                                    </Typography>
                                </Box>
                            </Grid>
                            <Grid item xs={12} md={5} order={{xs:1, md:2}} >
                                <Box className='pjt-right_media'>
                                    <img src={projectImg1} alt="" />
                                </Box>
                            </Grid>
                        </Grid>
                    </Container>
                    </Box>

                    <Box className='pjt-middle-section'>
                    <Container>
                        <Grid alignItems='center' container spacing={3}>
                            <Grid item xs={12} md={5}>
                                <Box className='pjt-right_media'>
                                    <img src={projectImg1} alt="" />
                                </Box>
                            </Grid>
                            <Grid item xs={12} md={7}>
                                <Box className='pjt-right_content'>
                                <Typography variant="h4">الضبيب ووكيل</Typography>
                                    <Typography>
                                    دشَّن المركز الوطني لسلامة الطرق بالشراكة مع القوات الخاصة لأمن الطرق اليوم حملة ” درب السلامة ” تزامناً مع بدء موسم الإجازة بمركز الضبط الأمني بطريق الرياض / الدمام بحضور قائد القوات الخاصة لأمن الطرق اللواء خالد الضبيب ووكيل وزارة النقل المهندس طارق الشامي ورئيس المركز الوطني لسلامة الطرق الدكتور علي الغامدي
                                وتستهدف الحملة المسافرين خلال موسم الإجازة لرفع مستوى التوعية بالسلامة المرورية عن طريق المنشورات الورقية ولوحات الطرق والمحتوى الرقمي بمواقع التواصل الاجتماعي

                                <br /><br />
                                وركزت الحملة على تعزيز التوعية بأبرز الممارسات السليمة لقائدي المركبات كضرورة ربط حزام الأمان وفحص المركبة والإطارات قبل السفر وأخذ قسط كافي من النوم، إلى جانب تعزيز التنبيه بأبرز الممارسات الخاطئة التي قد يقع فيها قائد المركبة كاستخدام الجوال والسرعة الزائدة 
                                وركز جانب من الحملة على غرس مفاهيم سلامة الأطفال عبر استهدافهم برسائل توعوية تأسس هذه المبادئ
                                    </Typography>
                                </Box>
                            </Grid>
                        </Grid>
                        <Grid sx={{mt:12}} alignItems='center' container spacing={3}>
                            <Grid item xs={12} md={7} order={{xs:6, md:5}} >
                                <Box className='pjt-right_content'>
                                    <Typography variant="h4">الضبيب ووكيل</Typography>
                                    <Typography>
                                    دشَّن المركز الوطني لسلامة الطرق بالشراكة مع القوات الخاصة لأمن الطرق اليوم حملة ” درب السلامة ” تزامناً مع بدء موسم الإجازة بمركز الضبط الأمني بطريق الرياض / الدمام بحضور قائد القوات الخاصة لأمن الطرق اللواء خالد الضبيب ووكيل وزارة النقل المهندس طارق الشامي ورئيس المركز الوطني لسلامة الطرق الدكتور علي الغامدي
                                وتستهدف الحملة المسافرين خلال موسم الإجازة لرفع مستوى التوعية بالسلامة المرورية عن طريق المنشورات الورقية ولوحات الطرق والمحتوى الرقمي بمواقع التواصل الاجتماعي

                                <br /><br />
                                وركزت الحملة على تعزيز التوعية بأبرز الممارسات السليمة لقائدي المركبات كضرورة ربط حزام الأمان وفحص المركبة والإطارات قبل السفر وأخذ قسط كافي من النوم، إلى جانب تعزيز التنبيه بأبرز الممارسات الخاطئة التي قد يقع فيها قائد المركبة كاستخدام الجوال والسرعة الزائدة 
                                وركز جانب من الحملة على غرس مفاهيم سلامة الأطفال عبر استهدافهم برسائل توعوية تأسس هذه المبادئ
                                    </Typography>
                                </Box>
                            </Grid>
                            <Grid item xs={12} md={5} order={{xs:5, md:6}} >
                                <Box className='pjt-right_media'>
                                    <img src={projectImg1} alt="" />
                                </Box>
                            </Grid>
                        </Grid>
                    </Container>
                    </Box>
                    <Box className='pjt-bottom-section'>
                    <Container>
                        <Grid alignItems='center' container spacing={3}>
                            <Grid item xs={12} md={5}>
                                <Box className='pjt-right_media'>
                                    <img src={projectImg1} alt="" />
                                </Box>
                            </Grid>
                            <Grid item xs={12} md={7}>
                                <Box className='pjt-right_content'>
                                <Typography variant="h4">الضبيب ووكيل</Typography>
                                    <Typography>
                                    دشَّن المركز الوطني لسلامة الطرق بالشراكة مع القوات الخاصة لأمن الطرق اليوم حملة ” درب السلامة ” تزامناً مع بدء موسم الإجازة بمركز الضبط الأمني بطريق الرياض / الدمام بحضور قائد القوات الخاصة لأمن الطرق اللواء خالد الضبيب ووكيل وزارة النقل المهندس طارق الشامي ورئيس المركز الوطني لسلامة الطرق الدكتور علي الغامدي
                                وتستهدف الحملة المسافرين خلال موسم الإجازة لرفع مستوى التوعية بالسلامة المرورية عن طريق المنشورات الورقية ولوحات الطرق والمحتوى الرقمي بمواقع التواصل الاجتماعي

                                <br /><br />
                                وركزت الحملة على تعزيز التوعية بأبرز الممارسات السليمة لقائدي المركبات كضرورة ربط حزام الأمان وفحص المركبة والإطارات قبل السفر وأخذ قسط كافي من النوم، إلى جانب تعزيز التنبيه بأبرز الممارسات الخاطئة التي قد يقع فيها قائد المركبة كاستخدام الجوال والسرعة الزائدة 
                                وركز جانب من الحملة على غرس مفاهيم سلامة الأطفال عبر استهدافهم برسائل توعوية تأسس هذه المبادئ
                                    </Typography>
                                </Box>
                            </Grid>
                        </Grid>
                        </Container>
                    </Box>
                </Box>   
            {/* </Container> */}
        </>
    );
};

export default ProjectSection;